docs/20-key-concepts/40-kog/10-oasgen-provider.md
```mermaid
graph LR
  subgraph K8s[Kubernetes Cluster]
    A[Declared <br> desired state]
  end

  subgraph EXT[External System]
    B[Observed <br> current state]
  end

  A -->|**Act** <br> create <br> update <br> delete| B
  A -->|**Observe** <br> findby <br> get| B
```
